Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_Swift/Framework_Swift-level1_source3.tmx
Source language: en_us
Languages: ja

source: Creates an instance of the codec.
ja: このコーデックのインスタンスを作成します。

source: Creates an integer from its big-endian representation, changing the byte order if necessary.
ja: それのビッグエンディアン表現から整数を作成します、必要ならばバイト順を変更します。

source: Creates an integer from its little-endian representation, changing the byte order if necessary.
ja: それのリトルエンディアン表現から整数を作成します、必要ならばバイト順を変更します。

source: Creates an integer from the given floating-point value, if it can be represented exactly.
ja: 与えられた浮動小数点値から整数を作成します、もしそれが正確に表現可能ならば。

source: Creates an integer from the given floating-point value, rounding toward zero.
ja: 与えられた浮動小数点値から整数を作成します、ゼロへの丸めを行います。

source: Creates an integer that captures the full value of the given object identifier.
ja: 与えられたオブジェクト識別子の完全な値を捕獲する整数を作成します。

source: Creates an unbounded range expression.
ja: 無境界範囲式を作成します。

source: Creates an unmanaged reference with an unbalanced retain.
ja: 管理されない参照を不均衡なリテイン（保持）で作成します。

source: Creates an unmanaged reference without performing an unbalanced retain.
ja: 管理されない参照を不均衡なリテイン（保持）を実行することなしに作成します。

source: Creates the asynchronous iterator that produces elements of this asynchronous sequence.
ja: 非同期イテレータを作成します、それはこの非同期シーケンスの要素を取り出すものです。

source: Creating Ranges of Scalars
ja: スカラーの範囲を作成する

source: Creating a Generator
ja: 生成子を作成する

source: Creating a Range Expression
ja: 範囲式を作成する

source: Creating a Scalar
ja: スカラーを作成する

source: Creating a String
ja: 文字列の作成

source: Creating a String Using Formats
ja: 文字列を様々な形式を使って作成する

source: Creating a String from Unicode Data
ja: 文字列をユニコードデータから作成する

source: Creating a String from a File or URL
ja: ファイルまたはURLから文字列を作成する

source: Creating a Task
ja: タスクを作成する

source: Creating a Task Group
ja: タスクグループを作成する

source: Creating a Throwing Task Group
ja: スローするタスクグループを作成する

source: Creating an Unbounded Range
ja: 無境界範囲の作成

source: Creating and Applying Differences
ja: 差異の作成と適用

source: Creating detached tasks should, generally, be avoided in favor of using async functions, async let declarations and await expressions - as those benefit from structured, bounded concurrency which is easier to reason about, as well as automatically inheriting the parent tasks priority, task-local storage, deadlines, as well as being cancelled automatically when their parent task is cancelled.
ja: 分離されたタスクの作成は、一般的には回避されるべきで、async関数、async let宣言とawait式を使う方を支持します - 構造化された、境界を定められた並行性からの利益それらとしては、それについて論理的に判断するのがより簡単であること、それだけでなく自動的に親タスクの優先度、タスクローカルストレージ、最終期限を継承すること、それだけでなくそれらの親タスクが取り消される時に自動的に取り消されること。

source: Custom Encoding and Decoding
ja: カスタムエンコーディングとデコーディング

source: Customizing Your Type's Reflection
ja: あなたの型のリフレクションのカスタマイズ

source: Deallocates the memory block previously allocated at this buffer pointer’s base address.
ja: このバッファポインタのもつベースアドレスで以前に割り当てられたメモリブロックを割り当て解除します。

source: Deallocates the memory block previously allocated at this pointer.
ja: このポインタで以前に割り当てられたメモリブロックを割り当て解除します。

source: Deallocates the previously allocated memory block referenced by this pointer.
ja: このポインタによって参照された以前に割り当てられたメモリブロックを割り当て解除します。

source: Debugging and Reflection
ja: デバッグとリフレクション

source: Declaration
ja: 宣言

source: Decoders should provide types conforming to UnkeyedDecodingContainer for their format.
ja: それらデコーダーは、それらの形式に対してUnkeyedDecodingContainerに準拠する型を提供すべきです。

source: Decodes a nested container and returns a Decoder instance for decoding super from that container.
ja: 入れ子にされたコンテナをデコードして、デコードするsuperに対するDecoderインスタンスをそのコンテナから返します。

source: Decodes a nested container keyed by the given type.
ja: 与えられた型によってキー付けされる入れ子にされたコンテナをデコードします。

source: Decodes a null value.
ja: null値をデコードします。

source: Decodes a single value of the given type.
ja: 与えられた型の単一の値をデコードします。

source: Decodes a value of the given type, if present.
ja: 与えられた型の値をデコードします、もし存在するならば。

source: Decodes a value of the given type.
ja: 与えられた型の値をデコードします。

source: Decodes an unkeyed nested container.
ja: キー付けされない入れ子にされたコンテナをデコードします。

source: Decoding Containers
ja: デコーディングコンテナ

source: Default Implementations
ja: 省略時実装

source: Default Literal Types
ja: 省略時のリテラル型

source: Default Types for Literals
ja: リラテルのための省略時の型

source: Default values
ja: 省略時の値

source: Default-ignorable code points are those that should be ignored by default in rendering (unless explicitly supported).
ja: 省略時無視可能なコード点は、初期状態では描画において無視されるべきです（明示的にサポートされる場合を除いて）。

source: Deinitializes the specified number of values starting at this pointer.
ja: このポインタで開始して、指定された数の値をデイニシャライズします。

source: Deinitializing typed memory does not unbind that memory’s type.
ja: 型付メモリのデイニシャライズは、そのメモリの型を束縛解除しません。

source: Depending on the type, it may make sense to allocate more or less storage than requested or to take no action at all.
ja: 型によって、要請されたよりも多くまたは少なく割り当てるまたは全く行動を起こさないことが道理にかなっているかもしれません。

source: Depending on the work you’re doing in the task, the correct way to stop that work varies.
ja: あなたがそのタスクにおいて行っている仕事に依存して、その仕事を止める正しい方法は様々です。

source: Deprecated
ja: 非推奨

source: Describing a String
ja: 文字列を記述する

source: Description
ja: 説明

source: Detached tasks (created by Task.detached) DO NOT inherit task priority, as they are “detached” from their parent tasks after all.
ja: 切り離された（Task.detachedによって作成された）タスクは、タスク優先度を継承「しません」、結局それらはそれらの親タスクから “分離される” ので。

source: Detached tasks do not get any of those benefits, and thus should only be used when an operation is impossible to be modelled with child tasks.
ja: 分離されたタスクは、それらの利益のどれも得られません、したがって演算が子タスクで形作られるのが不可能である時にのみ使われるべきです。

source: Detached tasks do not inherit task-local values, however tasks created using the Task { ... } initializer do inherit task-locals by copying them to the new asynchronous task, even though it is an un-structured task.
ja: 分離されたタスクは、タスクローカル値を継承しません、しかしながらTask { ... }イニシャライザを使って作成されたタスクは、タスクローカルをそれらを新しい非同期タスクにコビーすることによって継承します、たとえそれが構造化されないタスクであっても。

source: Diacritic nukta marks in Brahmi-derived scripts.
ja: ブラーフミー派生書体における発音区別ヌクタ記号。

source: Diacritic virama marks in Brahmi-derived scripts.
ja: ブラーフミー派生書体における発音区別ヴィラーマ記号。

source: Diacritics are scalars that linguistically modify the meaning of another scalar to which they apply.
ja: それら区別的発音符は、それに対してそれらが適用される、別のスカラーの意味を言語学的に修正するスカラーです。

source: Discussion
ja: 解説

source: Distinct marks at the bottom left.
ja: 左下での別個の記号。

source: Distinct marks at the bottom right.
ja: 右下での別個の記号。

source: Distinct marks at the top left.
ja: 左上での別個の記号。

source: Distinct marks at the top right.
ja: 右上での別個の記号。

source: Distinct marks directly above.
ja: 直上の別個の記号。

source: Distinct marks directly below.
ja: 直下の別個の記号。

source: Distinct marks extending above two bases.
ja: ２つの基盤の上に延びる別個の記号。

source: Distinct marks subtending two bases.
ja: ２つの基盤に対する別個の記号。

source: Distinct marks to the left.
ja: 左の別個の記号。

source: Distinct marks to the right.
ja: 右の別個の記号。

source: Divide
ja: 除算

source: Divide and assign
ja: 除算と代入

source: Divides the first value by the second and stores the quotient in the left-hand-side variable.
ja: 最初の値を２番目の値で除算して、商を左手側の変数に格納します。

source: Divides the first value by the second and stores the remainder in the left-hand-side variable.
ja: 最初の値を２番目の値で除算して、余りを左手側の変数に格納します。

source: Dividing by zero is not an error when using this method.
ja: ゼロによる除算は、このメソッドを使う場合はエラーではありません。

source: Do not advance the iterator or any copies of the iterator outside this method.
ja: イテレータやなんらかのイテレータのなんらかのコピーをこのメソッドの外側で前進させないでください。

source: Do not assign an instance of a nontrivial type through pointee to uninitialized memory.
ja: 自明でない型のインスタンスを、未初期化メモリへのpointeeを通してアサインしないでください。

source: Do not assign an instance of a nontrivial type through the subscript to uninitialized memory.
ja: 自明でない型のインスタンスを未初期化メモリへの添え字を通してアサインしないでください。

source: Do not call this initializer directly.
ja: このイニシャライザを直接に呼ばないでください。

source: Do not declare new conformances to StringProtocol.
ja: 新しい準拠事項をStringProtocolに宣言しないでください。

source: Do not persist the pointer and access it after the function has returned.
ja: そのポインタに固執すること、そして関数が返った後でそれにアクセスしないでください。

source: Do not rely on a previously stored index value after altering a collection with any operation that can change its length.
ja: あるコレクションをそれの長さを変える何らかの演算で手直し後に、以前に格納されたインデックス値を当てにしないでください。

source: Do not save hash values to use during a future execution.
ja: 将来の実行の間に使うためにハッシュ値を保存しないでください。

source: Do not store or return the pointer for later use.
ja: 後で使うためにポインタを格納したり返したりしないでください。

source: Doing so may become a compile-time error in the future.
ja: そうすることは、コンパイル時エラーに将来はなるかもしれません。

source: Don’t call this initializer directly.
ja: このイニシャライザを直に呼ばないでください。

source: Don’t call this method directly.
ja: このメソッドを直に呼ばないでください。

source: Don’t call this method from outside the task where this task group was created.
ja: このメソッドを、このタスクグループが作成されたところのタスクの外側から呼び出さないでください。

source: Don’t store substrings longer than you need them to perform a specific operation.
ja: 下位文字列を、あなたが特定の演算の実行にそれらを必要とするより長く、貯蔵しておかないでください。

source: Don’t try to store an unsafe task handle for use outside that method’s closure.
ja: 非安全タスクハンドルをそのメソッドのもつクロージャの外側で使うために格納しようとしないでください。

source: Download the playground below to get started.
ja: プレイグラウンドを下でダウンロードして始めましょう。

source: Dumps the given object’s contents using its mirror to standard output.
ja: 与えられたオブジェクトの内容をそれのミラーを使って標準出力にダンプします。

source: Dumps the given object’s contents using its mirror to the specified output stream.
ja: 与えられたオブジェクトの内容をそれのミラーを使って指定出力ストリームにダンプします。

source: Dynamic Sequences
ja: 動的なシーケンス

source: Each ExpressibleByStringInterpolation type has an associated StringInterpolation type which conforms to StringInterpolationProtocol.
ja: それぞれのExpressibleByStringInterpolation型は、ある結び付けられたStringInterpolation型を持ちそれはStringInterpolationProtocolに準拠します。

source: Each UnicodeDecodingResult instance can represent a Unicode scalar value, an indication that no more Unicode scalars are available, or an indication of a decoding error.
ja: 各UnicodeDecodingResultインスタンスは、ユニコードスカラー値、これ以上利用可能なユニコードスカラーがないしるし、またはデコードエラーのしるしとして表されることができます。

source: Each byte in memory is viewed as a UInt8 value independent of the type of values held in that memory.
ja: メモリ中の各バイトは、そのメモリ中に保持される値の型に影響を受けないUInt8値として眺められます。

source: Each call to the yielding functions will resume any awaiter on the next function.
ja: 関数それらを生み出すための各呼び出しは、次の関数に関する何らかの待機者を再開するでしょう。

source: Each code unit is stored as a UInt16 instance.
ja: 各コード単位はUInt16インスタンスとして格納されます。

source: Each code unit is stored as a UInt8 instance.
ja: 各コード単位はUInt8インスタンスとして格納されます。

source: Each element of a string is represented by a Character instance.
ja: 文字列の各要素は、あるCharacterインスタンスによって表現されます。

source: Each ill-formed sequence is replaced with a Unicode replacement character ("\u{FFFD}") and is measured as such.
ja: 各誤形式シーケンスは、ユニコード代替文字（"\u{FFFD}"）で置き換えられます、そしてそういったものとして測られます。

source: Each of these scalar values, in turn, is too large to fit into a single UTF-16 or UTF-8 code unit.
ja: それらスカラー値のそれぞれは、今度は、ある単一のUTF-16またはUTF-8コード単位にぴったり合うには大きすぎます。

source: Each property provides access to a view of the string as a series of code units, each encoded in a different Unicode encoding.
ja: 各プロパティは、文字列のあるビューへのアクセスを一続きのコード単位として提供し、それぞれが異なるユニコードエンコーディングにおいてエンコードされます。

source: Each scalar value is represented by a Unicode.Scalar instance and is equivalent to a UTF-32 code unit.
ja: 各スカラー値は、Unicode.Scalarインスタンスによって表されて、ひとつのUTF-32コード単位と同等です。

source: Each such period ends at a suspension point or the completion of the task.
ja: そのような期間のそれぞれは、一時停止地点またはタスクの完了で終わります。

source: Elements are sorted in ascending order.
ja: 要素は昇順にソートされます。

source: Elements that are used to split the collection are not returned as part of any subsequence.
ja: コレクションを分割するのに使われる要素らは、どれかの下位シーケンスの一部として返されません。

source: Elements that are used to split the sequence are not returned as part of any subsequence.
ja: シーケンスを分割するのに使われる要素らは、どれかの下位シーケンスの一部として返されません。

source: Encoders and Decoders
ja: エンコーダとデコーダ

source: Encoders should provide types conforming to UnkeyedEncodingContainer for their format.
ja: エンコーダは、それらの形式に対してUnkeyedEncodingContainerに準拠する型を提供するべきです。

source: Encodes a Unicode scalar as a UTF-32 code unit by calling the given closure.
ja: UTF-32コード単位としてのユニコードスカラーを与えられたクロージャを呼び出すことによってエンコードします。

source: Encodes a Unicode scalar as a series of code units by calling the given closure on each code unit.
ja: 与えられたクロージャを各コード単位上で呼び出すことによって、ユニコードスカラーを一連のコード単位としてエンコードします。

source: Encodes a nested container and returns an Encoder instance for encoding super into that container.
ja: 入れ子にされたコンテナをエンコードして、superをそのコンテナへとエンコードするためのEncoderインスタンスを返します。

source: Encodes a nested container keyed by the given type and returns it.
ja: 与えられた型によってキー付けされる入れ子にされたコンテナをエンコードしてそれを返します。

source: Encodes a null value.
ja: null値をエンコードします。

source: Encodes a reference to the given object only if it is encoded unconditionally elsewhere in the payload (previously, or in the future).
ja: 与えられたオブジェクトへの参照をエンコードします、それがそのペイロードの中のどこか他の所で無条件にエンコードをされる（以前に、またはこの先に）場合に限ります。

source: Encodes a single value of the given type.
ja: 与えられた型の単一の値をエンコードします。

source: Encodes an unkeyed encoding container and returns it.
ja: キー付けされないエンコーディングコンテナをエンコードしてそれを返します。

source: Encodes the elements of the given sequence.
ja: 与えられたシーケンスに属する要素をエンコードします。

source: Encodes the given value.
ja: 与えられた値をエンコードします。

source: Encodes the scalars of this vector into the given encoder in an unkeyed container.
ja: このベクターのスカラーそれらをこの与えられたエンコーダへとキー付けされないコンテナの中に符号化します。

source: Encodes this value into the given encoder, when the type’s RawValue is UInt8.
ja: この値をその与えられたデコーダへとデコードします、その型のもつRawValueがUInt8である場合。

source: Encodes this value into the given encoder.
ja: この値を与えられたエンコーダにエンコードします。

source: Encoding Containers
ja: エンコーディングコンテナ

source: Encoding and Decoding
ja: エンコーディングとデコーディング

source: Encoding and Decoding Custom Types
ja: あつらえの型のエンコーディングとデコーディング

source: Encoding and Storage
ja: エンコードとストレージ

source: Encoding, Decoding, and Serialization
ja: エンコード、デコード、そしてシリアライズ

source: Enumeration Case
ja: 列挙ケース

source: Enumeration Cases
ja: 列挙ケース

source: Equal
ja: 等しい

source: Equality and Ordering
ja: 同等性と順序

source: Equality is the inverse of inequality.
ja: 同等性は、不等性の裏返しです。

source: Equivalent to a ? .!b : b.
ja: 次に相当します、a ? .!b : b。

source: Equivalent to a ? SIMDMask(repeating: true) : b.
ja: 次に相当します、a ? SIMDMask(repeating: true) : b。

source: Equivalent to a ? b : SIMDMask(repeating: false).
ja: 次に相当します、a ? b : SIMDMask(repeating: false)。

source: Equivalent to b ? .!a : a.
ja: 次に相当します、b ? .!a : a。

source: Equivalent to b ? SIMDMask(repeating: true) : a
ja: 次に相当します、b ? SIMDMask(repeating: true) : a。

source: Equivalent to b ? a : SIMDMask(repeating: false).
ja: 次に相当します、b ? a : SIMDMask(repeating: false)。

source: Equivalent to:
ja: 次に等しい：

source: Error handling
ja: エラー処理

source: Errors
ja: エラー

source: Escaping the pointer to use after the execution of the function is undefined behavior.
ja: 関数の実行の後に使うためにポインタを脱出させることは、未定義の挙動となります。

source: Essentials
ja: 要点

source: Evaluates a closure while ensuring that the given instance is not destroyed before the closure returns.
ja: あるクロージャを評価する一方で与えられたインスタンスがそのクロージャが返る前に破棄されないことを確実にします。

source: Every distinct value of the conforming type has a corresponding unique value of the RawValue type, but there may be values of the RawValue type that don’t have a corresponding value of the conforming type.
ja: 準拠する型のすべての個々の値は、RawValue型の対応する特有な値を持ちます、しかし準拠する型の値に対応しないRawValue型の値があっても構いません。

source: Every element of numbers up to, but not including, the first negative value is included in the result.
ja: 最初の負の値までの、しかしそれを含まない、numbersのすべての要素は、この結果の中に含まれます。

source: Every unsigned integer is its own magnitude, so for any value x, x == x.magnitude.
ja: すべての符号なし整数は、それ自身が規模（magnitude）です、それで何らかの値xにとって、x == x.magnitudeです。

source: Every value in the range 0..<upperBound is equally likely to be returned.
ja: 範囲0..<upperBoundの中の全ての値は、等しく返される可能性をもちます。

source: Examples
ja: 例

source: Exchanges the byte values at the specified indices in this buffer’s memory.
ja: このバッファの持つメモリの中の指定インデックスでの値を交換します。

source: Exchanges the values at the specified indices of the buffer.
ja: そのバッファの指定インデックスでの値を交換します。

source: Exchanges the values at the specified indices of the collection.
ja: そのコレクションの指定インデックスでの値を交換します。

source: Exchanges the values of the two arguments.
ja: ２つの引数の値を交換します。

source: Execute an operation with a cancellation handler that’s immediately invoked if the current task is canceled.
ja: 現在のタスクが取り消されるならば直ちに発動されるある取り消しハンドラを備えた操作を遂行します。

source: Executes the given closure while temporarily binding the memory referenced by this buffer to the given type.
ja: 与えられたクロージャを実行します、その間はこのバッファによって参照されるメモリを与えられた型に一時的に束縛しています。

source: Executes the given closure while temporarily binding the specified number of instances to the given type.
ja: 与えられたクロージャを実行します、その間は指定された数のインスタンスを与えられた型に一時的に束縛しています。

source: Execution resumes after the await completes.
ja: 遂行は、awaitが完了した後に再開します。

source: Executors
ja: エグゼキュータ（遂行者）

source: Existential Types
ja: 存在型

source: Exiting a Program
ja: プログラムの終了

source: Experiment with Swift standard library types and learn high-level concepts using visualizations and practical examples.
ja: いろいろなSwift標準ライブラリ型を試したり、視覚化や実践例を使うことで高水準概念を学んでください。

source: Explore the Standard Library
ja: 標準ライブラリ探索

source: Extending the compared character count to 15 includes the differing characters, so a nonzero result is returned.
ja: 比較する文字を15を数えるまで広げることは異なる文字を含みます、それで非ゼロの結果が返されます。

source: Extracts the scalars at specified indices to form a SIMD16.
ja: 形式SIMD16への指定インデックスそれらでのスカラーを抽出します。

source: Extracts the scalars at specified indices to form a SIMD2.
ja: 形式SIMD2への指定インデックスそれらでのスカラーを抽出します。

source: Extracts the scalars at specified indices to form a SIMD3.
ja: 形式SIMD3への指定インデックスそれらでのスカラーを抽出します。

source: Extracts the scalars at specified indices to form a SIMD32.
ja: 形式SIMD32への指定インデックスそれらでのスカラーを抽出します。

source: Extracts the scalars at specified indices to form a SIMD4.
ja: 形式SIMD4への指定インデックスそれらでのスカラーを抽出します。

source: Extracts the scalars at specified indices to form a SIMD64.
ja: 形式SIMD64への指定インデックスそれらでのスカラーを抽出します。

source: Extracts the scalars at specified indices to form a SIMD8.
ja: 形式SIMD8への指定インデックスそれらでのスカラーを抽出します。

source: Finally, memory that was allocated previously may have been deallocated, leaving existing pointers referencing unallocated memory.
ja: 結局、以前にアロケートされたメモリはデアロケートされるかもしれません、アロケートされないメモリを参照している既存のポインタはそのままです。

source: Finding Characters
ja: 文字を見つける

source: Finding Substrings
ja: 下位文字列を見つける

source: Finding the Absolute Value
ja: 絶対値を見つける

source: First Steps
ja: 初歩

source: First, retrieve a sequence’s iterator, and then call the iterator’s next() method until it returns nil.
ja: まず、あるシーケンスのもつイテレータを見つけて取ってきてください、そしてそのイテレータの持つnext()メソッドを、それがnilを返すまで呼び出してください。

source: Floating Point
ja: 浮動小数点

source: Floating-Point Type Aliases
ja: 浮動小数点型エイリアス

source: Floating-Point Values
ja: 浮動小数点値

source: For a pointer p, the memory at p + i must be initialized when reading the value by using the subscript.
ja: あるポインタpに対して、p + iでのメモリは、添え字を使うことで値を読み出すとき初期化されなければなりません。

source: For a pointer p, the memory at p + i must be initialized.
ja: あるポインタpに対して、p + iでのメモリは、初期化されなければなりません。

source: For a task to respect cancellation it must cooperatively check for it while running.
ja: 取り消しを遵守するタスクに対してそれは動作している間に協力してそれを確認しなければなりません。

source: For a value x, a distance n, and a value y = x.advanced(by: n), x.distance(to: y) == n.
ja: 値x、隔たりn、および値y = x.advanced(by: n)に対して、x.distance(to: y) == n。

source: For a value x, the result of x.dividedReportingOverflow(by: 0) is (x, true).
ja: 値xに対して、x.dividedReportingOverflow(by: 0)の結果は(x, true)です。

source: For a value x, the result of x.remainderReportingOverflow(dividingBy: 0) is (x, true).
ja: 値xに対して、x.remainderReportingOverflow(dividingBy: 0)の結果は(x, true)です。

source: For all other scalars, this property is nil.
ja: 全ての他のスカラーに対して、このプロパティはnilです。

source: For an index i into a collection c, calling c.index(after: i) returns the same index every time.
ja: コレクションcへのインデックスiに対して、c.index(after: i)を呼び出すことはいつでも同じインデックスを返します。

source: For any two integers a and b, their quotient q, and their remainder r, a == b * q + r.
ja: 何らかの２つの整数aとb、それらの商q、そしてそれらの余りrに対して、a == b * q + r。

source: For any value, x + .zero == x and .zero + x == x.
ja: あらゆる値に対して、x + .zero == xかつ.zero + x == x。

source: For any values a and b, a != b implies that a == b is false.
ja: 何らかのaとbに対して、a != bはa == bがfalseであることを意味します。

source: For any values a and b, a == b implies that a != b is false.
ja: 何らかの値aとbに対して、a == bはa != bがfalseであることを意味します。

source: For collections that don’t conform to RandomAccessCollection, accessing the count property iterates through the elements of the collection.
ja: RandomAccessCollectionに準拠しないコレクションに対して、countプロパティにアクセスすることはコレクションの要素を始めから終わりまで反復します。

source: For convenience, the standard assigns symbolic names to a subset of these combining classes.
ja: 利便性のため、この標準は象徴名をそれら結合クラスのサブセットに割り当てます。

source: For encoders which don’t support this feature, the default implementation encodes the given object unconditionally.
ja: この機能をサポートしないエンコーダに対して、省略時の実装は与えられたオブジェクトを無条件にエンコードします。

source: For example, 6 is a multiple of 3 because 6 = 2*3.
ja: 例えば、6は3の倍数です、なぜなら6 = 2*3なので。

source: For example, a call to init(type:predicate:anchor:limit:resultsHandler:) takes a completion handler, but the call that needs to await is the call to execute(_:).
ja: 例えば、init(type:predicate:anchor:limit:resultsHandler:)への呼び出しは完了ハンドラをとります、しかしawaitする必要がある呼び出しは、execute(_:)への呼び出しです。

source: For example, a lowercase “e” with an acute accent above it ("é") uses 2 bytes for its UTF-8 representation: 0b11000011 (195) and 0b10101001 (169).
ja: 例えば、それの上に鋭アクセントを持つ小文字の“e”（"é"）は、それのUTF-8表現のために２バイト使います：0b11000011（195）と0b10101001（169）。

source: For example, a rendering engine might display “fl” in English as a connected glyph; inserting the zero width non-joiner would force them to be rendered as disconnected glyphs.
ja: 例えば、あるレンダリングエンジンは “fl” を英語において１つの結合される字体として表示するかもしれません；ゼロ幅非接合子を挿入することは、それらを分離した字体それらとして描出される様に強制します。

source: For example, an ASCII character like the capital letter A is represented by a single element in each of its four views.
ja: 例えば、大文字のAのようなあるひとつのASCII文字は、それの４つのビューのそれぞれにおいて単一の要素で表されます。

source: For example, an attempt to convert the position of a UTF-16 trailing surrogate returns nil.
ja: 例えば、UTF-16の後続サロゲートの位置を変換する試みはnilを返します。

source: For example, an attempt to convert the position of a UTF-8 continuation byte results in nil.
ja: 例えば、UTF-8継続バイトの位置を変換しようとする試みは、nilという結果になります。

source: For example, an attempt to convert the position of a UTF-8 continuation byte returns nil.
ja: 例えば、UTF-8の継続バイトの位置を変換する試みはnilを返します。

source: For example, an attempt to convert the position of the combining acute accent ("\u{0301}") fails.
ja: 例えば、結合文字のアキュートアクセント（"\u{0301}"）の位置を変換する試みは失敗します。

source: For example, an attempt to convert the position of the trailing surrogate of a UTF-16 surrogate pair results in nil.
ja: 例えば、UTF-16のサロゲートペアの後続サロゲートの位置を変換する試みはnilという結果になります。

source: For example, because UTF-8 and UTF-16 represent high Unicode code points differently, an attempt to convert the position of the trailing surrogate of a UTF-16 surrogate pair fails.
ja: 例えば、UTF-8とUTF-16は高位ユニコードコード点を異なって表すので、UTF-16のサロゲートペアの後続サロゲートの位置を変換する試みは失敗します。

source: For example, consider Core Foundation’s CFArrayCreateMutable(_:_:_:) function.
ja: 例えば、Core FoundationのCFArrayCreateMutable(_:_:_:)関数を考えてみてください。

source: For example, consider the sequence "\u{0041}\u{0301}\u{0316}" (LATIN CAPITAL LETTER A, COMBINING ACUTE ACCENT, COMBINING GRAVE ACCENT BELOW).
ja: 例えば、このシーケンス"\u{0041}\u{0301}\u{0316}" (LATIN CAPITAL LETTER A, COMBINING ACUTE ACCENT, COMBINING GRAVE ACCENT BELOW) を考えてみてください。

source: For example, if you update the last element of the absences array from 0 to 2, the secondHalf slice is unchanged.
ja: 例えば、あなたがabsences配列の最後の要素を0から2に更新する場合、secondHalfスライスは変化していません。
